In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [4]:
usuario = 'postgres'
contraseña = 'postgre'
host = 'localhost'
puerto = '5432'
base_de_datos = 'postgres'

In [6]:
conexion = f'postgresql+psycopg2://{usuario}:{contraseña}@{host}:{puerto}/{base_de_datos}'

In [8]:
conn = create_engine(conexion)

In [10]:
conn

Engine(postgresql+psycopg2://postgres:***@localhost:5432/postgres)

In [12]:
try:
    version = pd.read_sql("SELECT version();", conn).iloc[0, 0]
    print("Conexión exitosa con SQLAlchemy.")
    print(f"Versión del servidor PostgreSQL: {version}")
except Exception as e:
    print(f"Ocurrió un error al conectar con SQLAlchemy: {e}")

Conexión exitosa con SQLAlchemy.
Versión del servidor PostgreSQL: PostgreSQL 17.5 on x86_64-windows, compiled by msvc-19.43.34808, 64-bit

In [14]:
consulta_1 = """
SELECT table_name
FROM information_schema.tables
WHERE table_schema = 'dw_tfm_restaurantes'
ORDER BY table_name;
"""
pd.read_sql(consulta_1, conn)

               table_name
0           aparcamientos
1              dim_barrio
2            dim_distrito
3          flujo_peatones
4               licencias
5    menu_restaurantes_mx
6        poblacion_madrid
7   residentes_demografia
8            restaurantes
9                terrazas
10     transporte_publico

In [16]:
consulta_2 = """
SELECT *
FROM 
  information_schema.columns 
WHERE 
  table_name = 'transporte_publico';
"""
pd.read_sql(consulta_2, conn)

,table_catalog,table_schema,table_name,column_name,ordinal_position,column_default,is_nullable,data_type,character_maximum_length,character_octet_length,...,is_identity,identity_generation,identity_start,identity_increment,identity_maximum,identity_minimum,identity_cycle,is_generated,generation_expression,is_updatable
0,postgres,dw_tfm_restaurantes,transporte_publico,id_estacion,1,nextval('dw_tfm_restaurantes.transporte_public...,NO,integer,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
1,postgres,dw_tfm_restaurantes,transporte_publico,tipo,2,None,YES,character varying,100.0,400.0,...,NO,None,None,None,None,None,NO,NEVER,None,YES
2,postgres,dw_tfm_restaurantes,transporte_publico,nombre,3,None,YES,character varying,255.0,1020.0,...,NO,None,None,None,None,None,NO,NEVER,None,YES
3,postgres,dw_tfm_restaurantes,transporte_publico,latitud,4,None,YES,double precision,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
4,postgres,dw_tfm_restaurantes,transporte_publico,longitud,5,None,YES,double precision,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES

In [18]:
consulta_3= """
SELECT 
  column_name, 
  data_type, 
  character_maximum_length, 
  is_nullable, 
  column_default 
FROM 
  information_schema.columns 
WHERE 
  table_name = 'transporte_publico'
ORDER BY
    ordinal_position
"""

pd.read_sql(consulta_3, conn)

,column_name,data_type,character_maximum_length,is_nullable,column_default
0,id_estacion,integer,NaN,NO,nextval('dw_tfm_restaurantes.transporte_public...
1,tipo,character varying,100.0,YES,None
2,nombre,character varying,255.0,YES,None
3,latitud,double precision,NaN,YES,None
4,longitud,double precision,NaN,YES,None

Leer fichero

In [22]:
df_transporte_publico = pd.read_excel("./ficheros/B9_Estaciones_Metro_Renfe.xlsx")
df_transporte_publico.head(10)

               Tipo                  Nombre    Latitud  Longitud
0  Cercanias Madrid              Fuencarral  40.501536 -3.682161
1   Metro de Madrid       Metro Tres Olivos  40.500472 -3.694295
2   Metro de Madrid  Acceso Calle del Simca  40.366339 -3.704809
3  Cercanias Madrid               El Goloso  40.558469 -3.713830
4  Cercanias Madrid         Villaverde Bajo  40.352592 -3.683981
5  Cercanias Madrid             Las Aguilas  40.381459 -3.780377
6   Metro de Madrid                Delicias  40.400473 -3.693058
7   Metro de Madrid              Mirasierra  40.491000 -3.716335
8  Cercanias Madrid         Doce de Octubre  40.379021 -3.698739
9  Cercanias Madrid             Embajadores  40.405225 -3.702894

In [26]:
# Normalizamos a minusculas los títulos
df_transporte_publico.columns = df_transporte_publico.columns.str.lower().str.replace(' ', '_')

In [28]:
df_transporte_publico.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   tipo      250 non-null    object
 1   nombre    250 non-null    object
 2   latitud   250 non-null    float64
 3   longitud  250 non-null    float64
dtypes: float64(2), object(2)
memory usage: 7.9+ KB

In [30]:
df_transporte_publico.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
tipo,250,2,Metro de Madrid,215,NaN,NaN,NaN,NaN,NaN,NaN,NaN
nombre,250,227,Delicias,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
latitud,250.0,NaN,NaN,NaN,40.430126,0.042256,40.331632,40.399952,40.42688,40.46328,40.558469
longitud,250.0,NaN,NaN,NaN,-3.684733,0.043921,-3.807848,-3.709566,-3.691587,-3.659701,-3.567208

In [32]:
df_transporte_publico.isnull().sum()

tipo        0
nombre      0
latitud     0
longitud    0
dtype: int64

Duplicados para eliminar

In [34]:
df_transporte_publico.duplicated().values.any()

np.False_

Volcado Datos

In [36]:
df_transporte_publico.to_sql('transporte_publico', schema='dw_tfm_restaurantes', con = conn, if_exists = 'append', index=False)

250

In [38]:
count_db = pd.read_sql("SELECT COUNT(*) AS count FROM dw_tfm_restaurantes.transporte_publico", conn).iloc[0, 0]
count_df = len(df_transporte_publico)

print(f"Filas en DataFrame: {count_df}")
print(f"Filas en tabla dw_tfm_restaurantes: {count_db}")

if count_df == count_db:
    print("La carga se efectuó correctamente.")
else:
    print("Hay discrepancias en la cantidad de filas insertadas.")

Filas en DataFrame: 250
Filas en tabla dw_tfm_restaurantes: 250
La carga se efectuó correctamente.